{"meta":{"title":"DailyMinz","subtitle":"Daily mind, daily mints.","description":"Record my way to the knowledge.","author":"Kawashima Iwami","url":"https://en.dailyminz.org","root":"/"},"pages":[{"title":"About","date":"2025-09-29T08:29:34.129Z","updated":"2025-09-29T08:29:34.129Z","comments":false,"path":"about/index.html","permalink":"https://en.dailyminz.org/about/index.html","excerpt":"","text":"Where Am I? Welcome to DailyMinz, my personal blog. You can find many sorts of knowledge, reflections, observations and insights. After a progressing duration of five or six months, we have now confirmed our main content. DailyMinz will provides readers with thinking and insights into the society, history and humanity, aiming to offer humble views. Of course as I declared at the very inception of the blog, we are not confined to the realm of humanities. Instead, we dedicate to recording every step of my observations, learning and thinking, in order to leave a trace for my spiritual journey and sharing with you as mutual encouragement. You can also at any time take part in the construction of this blog, providing your own thinking and opinions, inspiring those who come after. Who Are You? I call myself Kawashima “StonePick” Iwami, 川島岩海. Copyright Notice All original articles on this blog remain the intellectual property of their respective authors and are licensed under CC BY-NC-SA 4.0. All other content belongs to its respective copyright holders and follows their applicable licensing terms. This blog is powered by Hexo framework, licensed under CC BY 4.0. This blog uses Fluid theme, licensed under the GNU General Public License v3.0. This blog employs Waline comment system, licensed under the GNU General Public License v2.0. The default banner images of this blog are sourced from Pexels, and are licensed under this term. The telescope and galaxy image was taken by Lucas Pezeta, and the aurora image was taken by Visit Greenland. If any content quoted on this blog infringes upon your copyright, please notify us via email. Upon verification, the infringing content will be promptly removed. The final right of interpretation of this copyright notice rests with me. Copyright 2024 - 2025 DailyMinz by StonePick"},{"title":"","date":"2025-10-06T09:50:16.845Z","updated":"2025-10-06T09:50:16.845Z","comments":false,"path":"js/datetrace.js","permalink":"https://en.dailyminz.org/js/datetrace.js","excerpt":"","text":"(function() { var times = document.getElementsByTagName('time'); if (times.length === 0) { return; } var posts = document.getElementsByClassName('post-content'); if (posts.length === 0) { return; } var pubTime = new Date(times[0].dateTime); /* 文章发布时间戳 */ var now = Date.now() /* 当前时间戳 */ var interval = parseInt(now - pubTime) /* 发布时间超过指定时间（毫秒） */ if (interval > 3600*24*180*1000){ var days = parseInt(interval / 86400000) /* 节点：180天 */ posts[0].innerHTML = '' + '🕗Timeliness ReminderThis is an article posted ' + days + ' ago, which might have been outdated.' + '' + posts[0].innerHTML; } })();"},{"title":"","date":"2025-09-29T05:30:02.742Z","updated":"2025-09-29T05:30:02.742Z","comments":false,"path":"js/duration.js","permalink":"https://en.dailyminz.org/js/duration.js","excerpt":"","text":"!(function() { /** 计时起始时间 **/ var start = new Date(\"2024/11/30 14:02:28\"); function update() { var now = new Date(); now.setTime(now.getTime()+250); days = (now - start) / 1000 / 60 / 60 / 24; dnum = Math.floor(days); hours = (now - start) / 1000 / 60 / 60 - (24 * dnum); hnum = Math.floor(hours); if(String(hnum).length === 1 ){ hnum = \"0\" + hnum; } minutes = (now - start) / 1000 /60 - (24 * 60 * dnum) - (60 * hnum); mnum = Math.floor(minutes); if(String(mnum).length === 1 ){ mnum = \"0\" + mnum; } seconds = (now - start) / 1000 - (24 * 60 * 60 * dnum) - (60 * 60 * hnum) - (60 * mnum); snum = Math.round(seconds); if(String(snum).length === 1 ){ snum = \"0\" + snum; } document.getElementById(\"timeDate\").innerHTML = \"The site has been running for \"+dnum+\" days\"; document.getElementById(\"times\").innerHTML = hnum + \" h \" + mnum + \" min \" + snum + \" sec\"; } update(); setInterval(update, 1000); })();"}],"posts":[{"title":"🌐 DailyMinz 1st Anniversary, Also Say About: How to Maintain Output Stream of Creation","slug":"1st-Anniversary","date":"2025-11-30T03:32:49.000Z","updated":"2025-11-30T03:47:45.051Z","comments":true,"path":"2025/11/30/1st-Anniversary/","permalink":"https://en.dailyminz.org/2025/11/30/1st-Anniversary/","excerpt":"One year ago, this date witnessed the birth of DailyMinz. I hope her can contain my all kinds of ideas and thoughts. Looking back today, this wish comes true smoothly. The problem is no longer nowhere to record and share humble views, but my productivity lagging the update's shortage. I beware of my shallow knowledge and, in order to sustain output streams, it is necessary to deepen study and training more and more.","text":"One year ago, this date witnessed the birth of DailyMinz. I hope her can contain my all kinds of ideas and thoughts. Looking back today, this wish comes true smoothly. The problem is no longer nowhere to record and share humble views, but my productivity lagging the update’s shortage. I beware of my shallow knowledge and, in order to sustain output streams, it is necessary to deepen study and training more and more. It’s my limit to update once a month. For articles in the category of “Academic Arguments”, I have to spare a rather long time to prepare before writing. Thus, though these posts are the backbone of this blog, however, I can’t bear the burden of depending barely on them for all the updates. So, you readers can see that this site is attempting to introduce posts in different categories to fill the blank outside “Arguments”, enriching this site. One of the attempts is “Book Reviews”, including reviews in detail on books and overviews and recommendations; another attempt is trying to analyze the non-textual media like videos. I hope to improve update frequency relying on this, though the effect seems to be insignificant. It turns out to be that new columns spread out thin the concentration of updates. Looking at the new series, unabandoned but undone, is nothing more than irritating myself. Maybe the most necessary thing next is to continue the unfinished. New ideas emerging is surely attracting, but for authors, it tops the list that to settle down and complete the items at hand. As long as the world spins, the topics worth writing won’t run out. In this case there’s no need to worry about new attracting topics are not written yet and mess up the present work. The blog has been walked through some time. Now it is the time when passion and sense of novelty fade, but I wish I could insist pushing her further. If I were done, I would be able to boost for this achievement. On the first anniversary of my blog, let me offer these brief words as praise. Speaking of insistence, I happen to have some thoughts to share with everyone on this anniversary. Why Writing? It’s impossible to say that writing is not for sharing, all the discourse solidified by writing presuppose the existence of readers, even diaries have their writers as (under ideal circumstances, the only) readers. Of course, writing is not barely for sharing. Text written down, in the first place, is shared to us ourselves. Solidifying the text on physical carriers, the writer gains ability to appreciate, examine, revise, and preserve his ideas. Externalizing the content of thoughts is a vital step. Human’s brain is no comparison with hard disk. The most die-hard belief though may have vagueness and loopholes. I can’t see myself through my own eyes, I have to get help from my duplicates and reflections. My duplicates duplicate me, but at the moment they come into being, they evade from me and become independent existence and intended objects. When they came into being, they fixed the me at this very moment as a statue for me to examine and preserve. Mirrors make humans see themselves clearly, while cameras bless people with a gift to copy the world. The meaning is that they assure the accuracy and, in the meantime, create an image of Reality. So does the art. Art’s nature is nothing more than capturing and reproducing moments of Reality for posterity to judge. As an ordinary, I am sincerely aware that I am not the one gifted, so I can’t trust the mind edifice built by merely brain’s performance. The disadvantage of thought is single thread, focusing on one thing while neglecting another. Externalizing the thought and its production, solidifying them on the paper, shifting them from the single-linear chronological mode of existence and performance to a synchronic one, and freeing them from being distorted unintentionally by the memory, are more than necessary. To implement, to rein in the unfettered imagination with logic and grammars, to make it be able to accept reflections and judgement in detail, are the meaning of writing for the writers. Writing allows us to examine ourselves as we’re examining others. When I write I am forced to organize language. This mind activity forces me to filter irrational productions and pré-réflexive prejudice, ultimately, resulting in two possible terminations: first, my opinion stands firmer in a more rational and scientific way; second, my opinion is declined by myself. If lacking self-filtering, I don’t know how many obsessive beliefs will hide under my cognition and control me. Writing makes this filter a forced and manifest action, it’s essential for creatures that are easily becoming arrogant like humans. Besides, the existence of readers also provides external driving power for this process. Readers’ feedback, where authors see themselves from, is very important for authors. And this might expose more unprecedented errors, or space to strive taller, or compliments and encouragement, into the sun. Text presupposes readers and expects readers. Text requires readers to explain and reveal itself to ultimately accomplish itself, so it is the nature of share of the text. Vice versa, the text by writers can also be beneficial for readers. For writers with lofty ambitions, there is no need to elaborate. The Slow Streams Steadily I’ve seen many high-quality blogs suspending further updates or shifting to microblogging. I can’t comment on their choices from my own perspective. Nevertheless, I for sure feel sorry for these sites and worried for the possibility that my blog may also get trapped in that situation. Non-profit writers’ activities are fragile that any disturbance from the real life can waver and even quench the passion for creation. One of the important reasons is the depressing desire to express, while another reason is the environment for creative work. Both two factors can empower creative activities and also suppress the enthusiasm. As for how to deal with one’s own mood, I don’t have good methods. If you do, please share with us in the comments below. As for how to face the disappointing environment, what I can think of is to change it, to escape as a coping way. Thus, I recently have been focusing on constructing the English edition of the blog and anyway, I got a somewhat nice beginning at last. A friendly blog, which is concentrating on ACG, Xeonzilla, has encountered the problem of the depressing desire to create as well, and published a post (in Chinese), casting spotlight on the difficulties that every blogger will encounter incisively: Interests changed Reality’s restriction Or rather, these are the common problems we modern people who are trying to evade the go-with-the-flow status will be faced with. Anyhow for creators, these problems are particularly heavy. I mentioned at the end of Brain Rot: Rich in Info, Ragged in Wisdom (in Chinese) that all sorts of chores in modern society are attempting to thieve our attention, but the attention is finite anyway. This is a question must be considered by every blogger that how to take back the stolen attention again. For me, writing the blog itself is a part of attention re-claiming training. It is essential to accept some tricks. My methods for fighting against laziness to update are: (1) setting up “series”, (2) ensuring topics available, and (3) participating in some writing events. Setting up article series schedules ensures that there is an apparent main line, ensuring topics available avoids speechlessness, and participation exploits external force urging deadlines. Of course, these tricks make sure that “there is something to say,” sustaining output, but unable to improve update frequency (undoubtedly, after all the writing speed is as fast as it should be). If the blog type permits, use life and career as materials are okay too. To this extent I envy technology bloggers whose jobs are strongly related with their writings, as a result they possess exceedingly high update motion. (However, looking around, in the Simplified Chinese world, blogs are almost entirely technology-related, and their content is severely homogenized, which I think is a pathological condition.) Faced with force majeure, we shouldn’t force ourselves to update as soon as possible. Writing should be a pleasurable and autonomous progress. To fill the lag in the update planning, enforcing yourself to acquire something disliked and uninterested will also devastate fun of writing. It is the slow brook that streams steadily and sturdily. Let ideas sediment at heart. There is always a random moment when words spontaneously flow from the nib. Also Be a Reader Writers barely writing ducking heads is no good. They need often be readers too and visit others’ websites. The habit to exchange links is reserved in Chinese world, so we are supposed to take advantage of it. When speaking on someone else’s turf, you can’t always say whatever you want. That’s when your manners and thinking skills are put to the test. Make yourself a well-behaved reader so that outside the blog world in the much noisier places on the internet you won’t put yourself at the mercy of ire. When we become readers, while judging others, we tend to wear a more critical eye. In the process of scrutinizing others, we unconsciously reflect on ourselves: Am I making the same mistakes? Are their shortcomings also mine? What pitfalls can I learn from this to avoid? And so on. Solving other people’s problems is also a way of developing our own problem-solving skills — it’s a win-win situation. The output stream shouldn’t just consist of articles on your own blog; it should also include comments and feedback on other people’s websites. Being a “responsive reader” encourages other authors and hones your own writing skills. Discussions can also reveal many things worth writing about on your own blog. I’ve recently been trying to write “long comments,” hoping to spark discussion and refine my own technique of offering initial thoughts. Some websites have strict word limits for comments, and I don’t quite understand the rationale behind these limits. Blogs, as long-form content platforms, should be more lenient regarding word counts. Comments can also serve as a guide or draft for new articles. Creating a topic “out of thin air” for writing might sometimes be difficult even with much thought, but extending and expanding on existing articles should be much easier. This is why I encourage writing long comments; they are easier to rewrite into new articles. So what are you waiting for? Comment something to cheer this pitiful author up! 😭","categories":[{"name":"Announcement","slug":"Announcement","permalink":"https://en.dailyminz.org/categories/Announcement/"}],"tags":[]},{"title":"Way to Live, Way to Create","slug":"Way-to-Live-Way-to-Create","date":"2025-10-21T15:15:29.000Z","updated":"2025-11-28T13:43:16.183Z","comments":true,"path":"2025/10/21/Way-to-Live-Way-to-Create/","permalink":"https://en.dailyminz.org/2025/10/21/Way-to-Live-Way-to-Create/","excerpt":"For some people, it seems an impossible task to create art. It is universally thought that being an artist requires talents. Thus, advising them to make art could wary them. They just have nothing to express on the canvas, not knowing what to do, and how to do.","text":"Book Review: The Creative Act: A Way of Being This post is a part of IndieWeb Book Club October. Check this page for October’s Hostage information. Toutes les grandes actions et toutes les grandes pensées ont un commencement dérisoire. Les grandes œuvres naissent souvent au détour d'une rue ou dans le tambour d'un restaurant. – Albert Camus, The Myth of Sisyphus Are you an artist? Do you want to be an artist? For some people, it seems an impossible task to create art. It is universally thought that being an artist requires talents. Thus, advising them to make art could be an unwilling thing to them. They just have nothing to express on the canvas, not knowing what to do, and how to do. Yeah, you might have already known something about the secret of the art. Of course, for creative tasks like art, talents are necessary. Nevertheless, it doesn’t mean that every ordinary person who wants to cast a glimpse on this enchanting world are up against the brick wall. A Gift is a jealous quality, whereas it is not ever an only entry condition. Nobody is going to be deprived of the right of entering the grand hall of Art. When we are talking about talents for art, we are talking about technics. But whether possessing such technics is not the point. The truth is that people believing in their shortage in art abilities lack the basic perception of what’s going around in the corner of their lives. In other words, they do lack the concentration on details that make wonders. In his widely known book The Creative Act: A Way of Being, Rick Rubin, a famous music producer who won five Grammy awards on one night in 2007, states his methodology for art creation in detail with eighty chapters, which covers almost every aspect of an artwork from the cradle. This book means nothing new to me (self-boosting), but a significant introduction to the hall of art for those who attempt to escape the situation of a life without miracles. The deepest abyss between you and Art is, from my point of view, an automatic procedure, which the book devotes to articulating, within you. Puts it clearer: the decisive difference between the Heidegger’s das Man (the They) and artists to a more general extent is that the people sliding into the They ignore nearby small marvels whereas the artists widen their eyes of curiosity beholding every uniqueness, and the most important is such observation is driven by something automatically, springing out from within. To internalize this procedure or power, you need to practice your mind. Through practice, there will be something subconscious drilling into your mindset unaware. It would be a long road for those who has been drowning in the ocean of dullness for a lengthy time of their lifespan. But it’s never too late to re-focus on Life itself, where Art is sourced from. This book has too many chapters. Maybe it will stun you especially at present when we are living in a world full of tyrannies of short clips and trivial tweets. But, on the contrary, this book is absolutely a perfect alternative of your time-killer and pastime object. Each chapter is short, written in simple but beauteous proses. This is a book you can pick up, turning to a random page and read, and feel. Ideally fit for those impatient. Another blogger has mentioned AlphaGo and Lee Sedol, which is an example used in the chapter Beginner’s Mind. I went to watch the documentary AlphaGo. When Move 37 that shocked the world appeared in front of Lee, he wore a strange expression. At first, he smiled with a little mockery and confusion, but soon, the smile froze and vanished, altered by a silent shock and, if I could say, somber and tension. Every time I review this scene, I have no capacity to evade such mixed feelings. As we push the artificial intelligence further outward the border of our perception, as we reach deeper into the dark universe, we may encounter more creations that do not belong to our own hands. At those moments yet-to-come, I hold a firm belief that the same turbulence swirling within Lee Sedol will actually recur in all of us. In the face of those unprecedented being, we are all beginners. But in many of the time it is the beginner’s luck that creates the unbelievable. So if you are persuaded by my post and get ready to read the book and gain sensibility for the world again, remember, keep humble, keep innocent, and marvelous fantasies are to lead you into the grand hall of Art.","categories":[{"name":"Book Reviews","slug":"Book-Reviews","permalink":"https://en.dailyminz.org/categories/Book-Reviews/"},{"name":"Aesthetics","slug":"Book-Reviews/Aesthetics","permalink":"https://en.dailyminz.org/categories/Book-Reviews/Aesthetics/"}],"tags":[{"name":"Art","slug":"Art","permalink":"https://en.dailyminz.org/tags/Art/"},{"name":"Rick Rubin","slug":"Rick-Rubin","permalink":"https://en.dailyminz.org/tags/Rick-Rubin/"}]},{"title":"🌐 Online Arguments ABCs","slug":"Online-Arguments-ABCs","date":"2025-03-11T08:25:26.000Z","updated":"2025-09-29T15:39:51.400Z","comments":true,"path":"2025/03/11/Online-Arguments-ABCs/","permalink":"https://en.dailyminz.org/2025/03/11/Online-Arguments-ABCs/","excerpt":"The magic of social media lies not only in its ability to connect people across distances but also in its ability to erase them. On the internet, a person exists in the eyes of others merely as a combination of data and self-narrative text. Stripped of their face, people seem to become \"bolder,\" less concerned with matters of \"saving face.\"","text":"🌐Translated PageThis passage is translated from its Simplified Chinese edition. Original edition shall prevail if divergence exists. The magic of social media lies not only in its ability to connect people across distances but also in its ability to erase them. On the internet, a person exists in the eyes of others merely as a combination of data and self-narrative text. Stripped of their face, people seem to become “bolder,” less concerned with matters of “social image.” This has given rise to two contradictory yet coexisting extremes of the internet. On the one hand, there is extreme egalitarianism — regardless of age or social status, everyone is freed from the constraints of real-world etiquette. On the other hand, there is a severe lack of respect — words are spoken without regard for others’ feelings, and even if no real-life grievances exist, insults and mockery flow freely. Conflicts of thought and ideology are inevitable wherever people gather. While debates do not necessarily (and often will not) lead to consensus or a clear distinction between right and wrong, it remains a fundamental principle for all internet users to engage in discussion with both courtesy and effectiveness. Below, I have summarized some personal strategies to avoid unnecessary quarrels and anger in online debates. Though they are based on my own experiences, I hope they can contribute in some small way to upholding rational discourse and serve as a starting point for further discussion. A! Speak with Kindness Before you dive into the turbulent waters of the comment section, take a moment to temper your fiery enthusiasm or righteous indignation. One unique advantage of online communication is that all “spoken expressions” are inevitably transformed into “written language,” turning voices into text. This means that when you present your thoughts to the public, you have more than one chance to reflect, review, and refine your words. Thinking before speaking does not mean weakening your stance or compromising your opinions—it simply means ensuring that your expression is not driven by aggressive emotions. The true power of language lies in logic and facts. Avoid expressing your viewpoints with hostility or sarcasm. Those who disagree with you are not your enemies. When presenting your views, adopt a tone of humility. Phrases like “I believe…” or “As far as I know, I think… makes more sense” help maintain a respectful and open discussion. When you show goodwill, even those who wish to challenge you will feel compelled to respond in a serious or courteous manner—if they do not, they put themselves at a moral disadvantage. Be mindful of your choice of words and tone. Try to convey humor and loveliness in your responses, and make good use of emojis and emoticons. Avoid starting or ending your statements with rhetorical questions. Rhetorical questions at the beginning or conclusion of a discussion can easily come across as sarcastic or condescending, making others perceive an air of superiority in your words. B! Argue with Reason The first and foremost rule is to stick “to the topic.” Always remember that your opponent’s political stance, beliefs, or personal character are not relevant to the discussion. Bringing them up only reflects poorly on your own manners. When making an argument, do not use opinions to justify opinions. In other words, avoid relying on political theories, moral standards, or ideological beliefs as proof of your correctness. These concepts are not objective facts and therefore cannot serve as valid evidence. While it is understandable to use personal anecdotes in an informal debate setting, this does not mean that authoritative sources and factual accuracy should be disregarded. To prevent your opponent from engaging in “selective blindness”, struggling with basic logical reasoning, or escalating the discussion into unnecessary conflict, presenting your arguments in an ordered list is highly effective. Clearly structuring your questions, objections, viewpoints, and supporting evidence in numbered points forces the other party to think critically and reduces the likelihood of an emotional outburst. A well-organized (1)(2)(3) breakdown leaves no room for deception or evasion. C! Know When to Stop Do not entertain the illusion that you can change someone’s mind. First, the window for debate on social media is extremely short—far too brief for you to systematically gather evidence and dismantle someone’s beliefs. Second, when a discussion takes a serious turn, not everyone is willing to continue. Most people lack the patience or ability to engage in prolonged discourse. The power of bias is immense. Changing the perspectives of those around you is already an uphill battle—let alone convincing complete strangers on the internet. Sometimes, silence is the best way to maintain your own peace of mind. When is it better to walk away from an argument? First, When you realize the other person’s only goal is to vent their emotions. Second, When you see that their counterarguments rely on labeling or stereotyping you, judging your viewpoint based on unrelated factors such as ideology or character rather than actual reasoning. Third, When you notice severe flaws in their logical reasoning. Always remember: the views you defend are not necessarily the absolute truth. No matter what, maintaining humility and respect should take priority. The ability to advance and retreat is equally crucial—choosing silence does not mean yielding to arrogance or ignorance, but rather ensuring that you do not become like them.","categories":[{"name":"Scratchy Sketches","slug":"Scratchy-Sketches","permalink":"https://en.dailyminz.org/categories/Scratchy-Sketches/"}],"tags":[{"name":"Internet","slug":"Internet","permalink":"https://en.dailyminz.org/tags/Internet/"},{"name":"Daily","slug":"Daily","permalink":"https://en.dailyminz.org/tags/Daily/"}]},{"title":"🌐 2024 Annual Summary","slug":"Annaul-Column-2024","date":"2024-12-31T17:31:22.000Z","updated":"2025-10-22T15:55:29.293Z","comments":true,"path":"2025/01/01/Annaul-Column-2024/","permalink":"https://en.dailyminz.org/2025/01/01/Annaul-Column-2024/","excerpt":"My blog launched on November 30th that has been exactly one month 'til now. This very one month is short that if it were not for my blogging, this piece of time would flow away in silence, like those short pieces of time in the past, unaware. However luckily I determined to start a blog and during the past month I didn't rely on video games as my spiritual drugs. Expedition into the upcoming unknown realms has already taken most of my concentration free to use.","text":"🌐Translated PageThis passage is translated from its Simplified Chinese edition. Original edition shall prevail if divergence exists. My blog launched on November 30th that has been exactly one month 'til now. This very one month is short that if it were not for my blogging, this piece of time would flow away in silence, like those short pieces of time in the past, unaware. However luckily I determined to start a blog and during the past month I didn’t rely on video games as my spiritual drugs. Expedition into the upcoming unknown realms has already taken most of my concentration free to use. I believe that energy is in shortage for modern humans. This times lacks no information. But, infomation receivers lacks capabilities to extract valuable knowledge and wisdom, which results in abundant waste of time and energy. Most people choose to stay still in comfortable circles, brainwashing themselves in infinitely looping short videos, flirting and irritating on social media. This is a form of spiritual self-castration. Modern people face an increasingly tense contradiction: on the one hand, there’s an information explosion; on the other, there’s the loss of subjectivity in the face of this overload. This loss of subjectivity manifests behaviorally as “amusement,” a trapping in an information cocoon, and being led by the nose by the information being fed to us; technically, it manifests as low media literacy and a deterioration in the ability to retrieve information. In my humble opinion, we living in modern world has sold out our subjectivity for admission fees to stay inside the comfortable circle, willing to degenerate into a vassal of fragmented information. I think I am a survivor against this castration wave. I can proudly declare that I never watch Tiktoks and microblogs thus I elade drwoning myself into tedious doomscrolling and chronic mental suicide. It is not an alarmist propaganda that I define this kind of pastime a chronic suicide. First, you can try if you can complete an article on one topic you are interested in, then check your word choice and logical structure; or rather there’s no need for actually an article, all you need to do is to list a clear and detailed mind map for it. I think this is the most direct means of detecting the extent to which thinking has been eroded by fragmented information. Second, find one or several opinions you oppose to or hate, write down your refutation and see how logical your argument is, whether it points to the opinions or their publishers, and whether it starts from the fact or a priori moral, religious, or political views. I believe this method is the most direct way to diagnose if your cognition is flattened. Last, evaluate your patience doing these tests can you know the breadth and inclusiveness — that a narrow mind usually demonstrates weak logic in expression, extreme exclusivity of cognition and intolerance of thought. I hold a firm belief that most people get a desperate answer. Nowadays, when information resources are abundant, the public’s abilities of searching and information processing are declining into a barren field. The poverty in materials are able to solve via personal efforts and social assistance. But how about the poverty in mind? For the ordinary, leaving the comfortable circle, in fact, is no different from committing another kind of suicide — maybe sometimes, people need to be blinded by the immediate; they may need bias and prejudice in order to preserve psychological stability and sustain a sense of communal identity. Thus, they choose to ignore whatever lies beyond their cognitive horizon — and in this process, social media serves as an instrument. The demand for amusement, in turn, fuels the reproduction and amplification of low-quality content, creating a vicious cycle. Admittedly, there are indeed a considerable number of content creators on fast-paced media platforms who produce educational and informative material, and their contribution to public enlightenment should not be dismissed. However, I would like to ask: how much substance can a creator truly deliver within a medium that lasts only a few minutes — or even less? How can the reliability of such content be verified? Can such brevity accommodate rigorous argumentation? Can the content be presented systematically, or can viewers engage with it through a coherent intellectual process? Qualified science communication is not merely about clearly telling the audience what something is; it must also teach them why it is so.The latter — the cultivation of an entire mode of scientific reasoning — is of far greater significance. If science popularization fails to promote scientific thinking, it cannot possibly raise public literacy. Evidently, the lack of media literacy has become an urgent and pressing issue. On December 2nd this year, Oxford University announced the Word of the Year: brain rot.[1] This is a vivid description of how long-term addiction to the social media has eroded brains. More importantly, this result, drawn from expert pre-selection and public polling, proves that people are beginning to pay attention to the negative effects of excessive entertainment, and more and more people are realizing that low-quality information is gradually corroding their minds. However this can be a long progress. The closed nature and strong stickiness of media platforms hinder the flow of valuable information. After establishing a relative user scale and information monopoly advantage, the platform’s pursuit of commercial interests has led to the deterioration of the quality of platform content. Canadian writer Cory Doctorow coined a word to vividly describe this phenomenon, which is enshittification. Doctorow proposed in a column in the Financial Times:“‘Enshittification’ is coming for absolutely everything.”“One by one, each of these constraints was eroded, leaving the enshittificatory impulse unchecked, ushering in the enshittocene.”[2] Humorous words foreshadow an equally humorous and absurd future. People living in the times of information lose control in information. How tragic. Among several information revolutions, this is the only time that the spread and abundance of information result in ignorance and division. In the past, thinkers believe that it was elites’ monopoly on media for knowledge. But today as such monopoly disappears, we find that things have changed. It is the literacy of the ignorant themselves cause the ignorance. To break the circle, we require every media worker, content creator and educator’s joint efforts. The mission of DailyMinz is to undertake my own reflections, driving me to identify problems, refine my knowledge, and deepen my thinking. I’m happy for readers to participate, discuss various issues together, improve together, and contribute to the goal of breaking this cycle. Blog’s Annual Summary Although the blog has been running for only one tewlfth of a year, please allow me to follow the tradition to do a “summary.” Content Updates This year, the blog has published 6 posts in total (this one excluded). Among these, there are 4 announcements and 1 translation; 2 posts are long articles. Original contents: Multilingual Support Completed (in Chinese) Why Refuse Christmas? (in Chinese) Though the former post was catergorized under “Announcement”, as a record of my build of a multilingual site, I believe it is qualified to be in the list. The latter one is my boast the most. ('cuz on earth you have written only two original posts!) From now on, long in-depth articles are mostly following this paradigm. Plus, the posts published might be modified, especially the recent updates. This is due to my bad habit of not thinking carefully before posting and then making afterthoughts after posting. I hope you can forgive me… However I swear that these modifications are usually about wording. When it comes to the substantial changes to the content, I will make a prominent mark at the corresponding place in the post. Sitework Look-back Internationalization Project Although I have found ways to build a multilingual site, synchronizing cross-language changes has become a tedious task due to the frequent configuration changes. Secondly, the original articles in other languages ​​were translated by Google and proofread by me later, but even so, using machine translation is still a very insincere thing, so I suspended updates in other languages ​​until I can free up my hands to complete the translation of existing articles. Additionally, due to cultural and social differences among readers who speak different languages, some articles may become “exclusive” to a particular language and no longer be translated. If you’re interested, you can help us translate! To reduce maintenance pressure, blog posts will generally no longer be updated synchronously after the multilingual content is relaunched. Currently I’m writing a tool to assist the maintenance of multilingual sites. An incomplete demo has been uploaded to GitHub. Visual Changes Some default pictures are changed. Default banners are sourced from Microsoft 365 Stock Images. The icon of the site is my doodle… Doesn’t count. Technical Adjustments Added giscus comment plugin based on GitHub Discussion. The advantage is serverless and that it doesn’t require third-party service registration. The disadvantage is that only GitHub users are permitted to comment while no support for anonymity. Added RSS feed. Added timeliness reminder, implememted via JavaScript injection. If an article was published more than 180 days ago, a reminder will be displayed in the header. The copyright information in the footer has been slightly reformatted, and the total site uptime has been added. This countdown begins when the first article is published, by subtracting the starting timestamp from the current timestamp and converting it into a human-readable time format. 2025 Prospects A massive series is in the works… Originally planned for Christmas 2024, but unfortunately the breadth and depth of the content exceeded my expectations, so the project schedule has been significantly extended. However, slow work produces fine results, and I’m confident I can deliver something that will shock you all! Translation of China Pathfinder series is still in the run. In the future there will be more valuable articles translated in a larger range. Several long articles are in the works, which topics are respectively — Duolingo’s Revelation… Needham’s Grand Questions Trends in International Mathematics and Science Study (TIMSS)… (Abandoned) The abandoned post plan has been merged into another one:Random Thoughts on Creativity: What Education Methods Bring Up to Us (in Chinese) Topics are more than just topics! DailyMinz also wishes to deepen the discussion in order to have a glimpse into the nature of this world and offer you with more universal inspirations. A new column has been scheduled, which is Books Share. Good books are solid bricks of the stairs toward wisdom. I hope to share every jotting with you all. Postscript It’s a pity that since the blog is only new and the content is thin, this year’s summary can only be done in such a hasty manner. I am really unwilling to accept this. I will continue to work hard next year to provide you with richer and more in-depth content! Reference ‘Brain rot’ named Oxford Word of the Year 2024. Oxford University Press. Last accessed: Dec., 31, 2024. https://corp.oup.com/news/brain-rot-named-oxford-word-of-the-year-2024/ ↩‘Enshittification’ is coming for absolutely everything. Financial Times. 🔐https://www.ft.com/content/6fb1602d-a08b-4a8c-bac0-047b7d64aba5. (Archived, Internet Archive) ↩","categories":[{"name":"Announcement","slug":"Announcement","permalink":"https://en.dailyminz.org/categories/Announcement/"}],"tags":[]},{"title":"🌐 RSS Available Now","slug":"RSS-Available-Now","date":"2024-12-18T16:00:00.000Z","updated":"2025-09-29T15:39:28.970Z","comments":true,"path":"2024/12/19/RSS-Available-Now/","permalink":"https://en.dailyminz.org/2024/12/19/RSS-Available-Now/","excerpt":"RSS Feed function has been available. Readers are able to subscribe the site with RSS applications, reading the posts more conveniently.","text":"🌐Translated PageThis passage is translated from its Simplified Chinese edition. Original edition shall prevail if divergence exists. RSS Feed function has been available. Readers are able to subscribe the site with RSS applications, reading the posts more conveniently. How to Subscribe? You can find the “Subscribe” button on the nav bar, which will direct you to an xml file after one click. There’s no need for you to care the chaos on the screen. What you are supposed to do is to copy the URL of the page and paste it in your RSS reader to accomplish the subscription. What is RSS and Why Choose It? If you have no idea what is RSS, there’s a brief explanation below. RSS, which is the short for Really Simple Syndication. As its name, this technology is used for syndicating the information from websites and pushing the collection to the subscriber, so that the user can surf it in the RSS reader, instead of checking updates of every website on their own. This resembles with the “follow” function on the content and social websites that as long as you “follow” websites interested in, the updates will be automatically pushed to your syndicator; however, different from the “follow” on the content platforms, RSS has capability to fetch updates far more than one or two sources. Reasons for choosing RSS: Saving time of checking updates manually. Beneficial for your concentrating on really valuable information. The categorizing function syndicators provide is helpful of sorting information sources, optimizing your info structure. Syndicators will fetch xml files from targeted links, in which the posts data are storaged. When content of websites is updated, so do the files. RSS has several standards, among which this site employs Atom.","categories":[{"name":"Announcement","slug":"Announcement","permalink":"https://en.dailyminz.org/categories/Announcement/"}],"tags":[]},{"title":"🌐 Multilingual Update Suspended","slug":"Multilingual-Update-Suspended","date":"2024-12-07T04:10:11.000Z","updated":"2025-11-29T11:56:32.192Z","comments":true,"path":"2024/12/07/Multilingual-Update-Suspended/","permalink":"https://en.dailyminz.org/2024/12/07/Multilingual-Update-Suspended/","excerpt":"Due to frequently technical adjustment of the blog currently, the maintenance of the program of other languages are suspended until the structure of the blog is set stably. During the suspension, non-simplified Chinese pages are inaccessible.","text":"🌐Translated PageThis passage is translated from its Simplified Chinese edition. Original edition shall prevail if divergence exists. Due to frequently technical adjustment of the blog currently, the maintenance of the program of other languages are suspended until the structure of the blog is set stably. During the suspension, non-simplified Chinese pages are inaccessible. When the maintenance resumed, I will firstly re-translate all the content and make changes according to the language it uses. After the translation, the synchronous update will be resumed. Q &amp; A Q: Can I still access the blog during the technical adjustments? A: You can always access the main language version of this blog, and the technical adjustments won’t restrict your access to the main language version. We apologize for any disruptions to your reading experience during the technical adjustments. If you find any issues with the site, please submit an issue in our community. Q: What does the technical adjustment involve? A: Art asset changes, page behavior optimizations, blog structure adjustments, commenting functionality, new features, and more. I’m also exploring writing a local management program to streamline workflow. Q: How long will the technical adjustments last? A: Not sure yet, but based on my plans, it shouldn’t last long. New major technical updates will be posted on the blog so readers can keep up to date. Q: I want to continue helping with article translations during the maintenance period. Is that still possible? A: Of course! You can always join our community to translate articles or submit new language requests. All review work will continue, but the additional language versions will only be available once the technical adjustments are complete. Q: Will the Simplified Chinese version continue to receive updates during this technical adjustment period? A: Absolutely! You don’t have to worry about the main language articles being discontinued due to technical issues. In fact, technical issues themselves can be the source of new articles!","categories":[{"name":"Announcement","slug":"Announcement","permalink":"https://en.dailyminz.org/categories/Announcement/"}],"tags":[]},{"title":"🌐 Why I Open the Blog","slug":"Why-I-Open-the-Blog","date":"2024-11-30T06:02:28.000Z","updated":"2025-09-29T15:39:27.326Z","comments":true,"path":"2024/11/30/Why-I-Open-the-Blog/","permalink":"https://en.dailyminz.org/2024/11/30/Why-I-Open-the-Blog/","excerpt":"I have always wanted to document my thoughts and ideas, but for a long time, various reasons prevented me from doing so. Prolonged procrastination made me realize that many of my earlier reflections and ideas have already been lost in the desert of memory, difficult to retrieve. When I finally found a rare moment of respite to pick up the pen I had long set aside, I discovered the poverty of my knowledge and creativity. I realized that my language skills had been eroded by fragmented media, leaving me unable to effectively organize my thoughts and articulate complex feelings.","text":"🌐Translated PageThis passage is translated from its Simplified Chinese edition. Original edition shall prevail if divergence exists. Hello World! I have always wanted to document my thoughts and ideas, but for a long time, various reasons prevented me from doing so. Prolonged procrastination made me realize that many of my earlier reflections and ideas have already been lost in the desert of memory, difficult to retrieve. When I finally found a rare moment of respite to pick up the pen I had long set aside, I discovered the poverty of my knowledge and creativity. I realized that my language skills had been eroded by fragmented media, leaving me unable to effectively organize my thoughts and articulate complex feelings. I believe the situation has become urgent. I need to continuously produce content—not fragmented, pretentious one-liners on various social media platforms, but complete and well-structured articles to document my intellectual journey. Thus, I’ve chosen this form, considered “outdated” in the modern internet landscape—a blog—to take on this task. Unlike most blogs, this one won’t restrict its focus to computer technology. Instead, it aims to present my personal perspectives within the scope of my knowledge. While an individual’s knowledge system is inevitably limited, I sincerely invite readers to provide valuable guidance, suggestions, and critiques. On this blog, I will share my knowledge, insights, and thoughts. I hope that through consistent updates, I can motivate myself to remain on the path of lifelong learning. This is also the reason behind the blog’s name, DailyMinz. If my humble efforts can offer even a small amount of help to others on their journeys, it would be deeply meaningful to me. Roadmap First, I need to address the technical issues of this blog. I’m still unfamiliar with the Hexo framework and haven’t decided whether to stick with the current template. Issues like comments and multilingual support are also pressing concerns. Second, there’s the matter of updating the blog content. But that’s not a problem—I already know what my next post will be about. Lastly, once the blog’s content becomes more substantial, I might create dedicated sections for specific topics to help maintain updates on those subjects. I might also write things like “weekly/monthly reports” or “monthly/quarterly/annual specials,” but that’s something for later.","categories":[{"name":"Announcement","slug":"Announcement","permalink":"https://en.dailyminz.org/categories/Announcement/"}],"tags":[]}],"categories":[{"name":"Announcement","slug":"Announcement","permalink":"https://en.dailyminz.org/categories/Announcement/"},{"name":"Book Reviews","slug":"Book-Reviews","permalink":"https://en.dailyminz.org/categories/Book-Reviews/"},{"name":"Aesthetics","slug":"Book-Reviews/Aesthetics","permalink":"https://en.dailyminz.org/categories/Book-Reviews/Aesthetics/"},{"name":"Scratchy Sketches","slug":"Scratchy-Sketches","permalink":"https://en.dailyminz.org/categories/Scratchy-Sketches/"}],"tags":[{"name":"Art","slug":"Art","permalink":"https://en.dailyminz.org/tags/Art/"},{"name":"Rick Rubin","slug":"Rick-Rubin","permalink":"https://en.dailyminz.org/tags/Rick-Rubin/"},{"name":"Internet","slug":"Internet","permalink":"https://en.dailyminz.org/tags/Internet/"},{"name":"Daily","slug":"Daily","permalink":"https://en.dailyminz.org/tags/Daily/"}]}